In [4]:
import pandas as pd
import numpy as np
import os

In [4]:
# ls data

# Q1-1

```
아래의 데이타를 이용하여 데이타프레임을 생성하여라.
name_list는 인덱스로 이용한다. 

data = {'kor':[40, 55, 66, 77, 34],
        'math':[70, 55, 66, 20, 40],
        'eng':[80, 95, 100, 77, 90]}
        
name_list = ['고길동','김희동','신윤지','이민호','박준희']        
```


# Q1-2
```
2명의 데이타를 추가하여라. 

신머신	55	67	88
윤파이	90	100	90
```

# Q1-3
sci 과목의 데이타를 추가하여라 

90, 45, 77, 90, 67, 90, 80

# Q1-4
eng 과목에서 eng 평균점수보다 높은 학생은?


# Q1-5
```
전체 과목의 평균을 구한 후 평균이상이면 O, 평균미만이면 X를 pass 컬럼에 출력하여라.
```

In [5]:
# Q1-1 
data = {'kor':[40, 55, 66, 77, 34],
        'math':[70, 55, 66, 20, 40],
        'eng':[80, 95, 100, 77, 90]}
        
name_list = ['고길동','김희동','신윤지','이민호','박준희']    

df = pd.DataFrame(data, index=name_list)
df

     kor  math  eng
고길동   40    70   80
김희동   55    55   95
신윤지   66    66  100
이민호   77    20   77
박준희   34    40   90

In [6]:
df.loc['신머신']=[55, 67, 88] & loc['윤파이']=[90, 100, 90]
df

SyntaxError: cannot assign to expression (836195016.py, line 1)

In [9]:
# Q1-2
df.loc['신머신']=[55, 67, 88]
df.loc['윤파이']=[90, 100, 90]
df

     kor  math  eng
고길동   40    70   80
김희동   55    55   95
신윤지   66    66  100
이민호   77    20   77
박준희   34    40   90
신머신   55    67   88
윤파이   90   100   90

In [10]:
# Q1-3
df['sci'] = [90, 45, 77, 90, 67, 90, 80]
df

     kor  math  eng  sci
고길동   40    70   80   90
김희동   55    55   95   45
신윤지   66    66  100   77
이민호   77    20   77   90
박준희   34    40   90   67
신머신   55    67   88   90
윤파이   90   100   90   80

In [12]:
# Q1-4
round(df['eng'].mean())

89

In [13]:
df['eng']>df['eng'].mean()

고길동    False
김희동     True
신윤지     True
이민호    False
박준희     True
신머신    False
윤파이     True
Name: eng, dtype: bool

In [14]:
df[df['eng']>df['eng'].mean()]

     kor  math  eng  sci
김희동   55    55   95   45
신윤지   66    66  100   77
박준희   34    40   90   67
윤파이   90   100   90   80

In [17]:
# Q1-5
df['total'] = df['kor'] + df['math'] + df['eng'] + df['sci']
df['avg'] = round(df['total']/4)
result = df['avg'].mean()
result

71.14285714285714

In [18]:
df.loc[df['avg']<result, 'pass'] = 'X'
df.loc[df['avg']>=result, 'pass'] = 'O'
df

     kor  math  eng  sci  total   avg pass
고길동   40    70   80   90    280  70.0    X
김희동   55    55   95   45    250  62.0    X
신윤지   66    66  100   77    309  77.0    O
이민호   77    20   77   90    264  66.0    X
박준희   34    40   90   67    231  58.0    X
신머신   55    67   88   90    300  75.0    O
윤파이   90   100   90   80    360  90.0    O

## Q 2-2
df_student 데이타프레임의 인덱스를 std1 ~ std11 형태로 변경하여라

           name             major  gender
std1       John  Computer Science    male
std2       Nate  Computer Science    male
std3    Abrabam           Physics    male
std4      Brian        Psychology    male
std5      Jenny         Economics  female
std6       Yuba         Economics  female
std7   Jennifer  Computer Science  female
std8     Edward  Computer Science    male
std9       Sara        Psychology  female
std10     Wendy         Economics  female
std11      Sera        Psychology  female

## Q 2-3
df_student 데이타프레임에서 gender 컬럼이 female 값을 가진 데이타만 별도로 데이타프레임 df_student_female 로 생성하여라.

In [21]:
student_list = [ { 'name' : 'John', 'major' : 'Computer Science', 'gender' : 'male'},
                 { 'name' : 'Nate', 'major' : 'Computer Science', 'gender' : 'male'},
                 { 'name' : 'Abrabam', 'major' : 'Physics', 'gender' : 'male'},
                 { 'name' : 'Brian', 'major' : 'Psychology', 'gender' : 'male'},
                 { 'name' : 'Jenny', 'major' : 'Economics', 'gender' : 'female'},
                 { 'name' : 'Yuba', 'major' : 'Economics', 'gender' : 'female'},
                 { 'name' : 'Jennifer', 'major' : 'Computer Science', 'gender' : 'female'},
                 { 'name' : 'Edward', 'major' : 'Computer Science', 'gender' : 'male'},
                 { 'name' : 'Sara', 'major' : 'Psychology', 'gender' : 'female'},
                 { 'name' : 'Wendy', 'major' : 'Economics', 'gender' : 'female'},
                 { 'name' : 'Sera', 'major' : 'Psychology', 'gender' : 'female'}
               ]

In [22]:
df_student = pd.DataFrame(student_list)

In [23]:
df_student

        name             major  gender
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abrabam           Physics    male
3      Brian        Psychology    male
4      Jenny         Economics  female
5       Yuba         Economics  female
6   Jennifer  Computer Science  female
7     Edward  Computer Science    male
8       Sara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [24]:
df_student_female = df_student[df_student['gender'] == 'female'].copy()
df_student_female

        name             major  gender
4      Jenny         Economics  female
5       Yuba         Economics  female
6   Jennifer  Computer Science  female
8       Sara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

           name             major  gender
std5      Jenny         Economics  female
std6       Yuba         Economics  female
std7   Jennifer  Computer Science  female
std9       Sara        Psychology  female
std10     Wendy         Economics  female
std11      Sera        Psychology  female

## Q 2-4
df_student_female 데이타프레임에서 name 컬럼을 인덱스로 설정하고 gender 컬럼을 삭제하여라

In [27]:
df_student_female.index = df_student_female['name']
df_student_female

              name             major  gender
name
Jenny        Jenny         Economics  female
Yuba          Yuba         Economics  female
Jennifer  Jennifer  Computer Science  female
Sara          Sara        Psychology  female
Wendy        Wendy         Economics  female
Sera          Sera        Psychology  female

In [30]:
df_student_female.del(['name', 'gender'])
df_student_female

SyntaxError: invalid syntax (2247247740.py, line 1)

In [31]:
df_student_female.drop(['name', 'gender'], axis=1)

                     major
name
Jenny            Economics
Yuba             Economics
Jennifer  Computer Science
Sara            Psychology
Wendy            Economics
Sera            Psychology

                     major
name
Jenny            Economics
Yuba             Economics
Jennifer  Computer Science
Sara            Psychology
Wendy            Economics
Sera            Psychology

## Q 2-5
df_student 데이타프레임에서 'Computer Science' 과를 제외한 나머지 데이타로 데이타프레임 df_student2를 생성하여라. 이때 인덱스는 name 컬럼으로 변경한다

In [32]:
df_student2 = df_student[df_student['major'] != 'Computer Science' ].copy()
df_student2.set_index('name', inplace=True)
df_student2

              major  gender
name
Abrabam     Physics    male
Brian    Psychology    male
Jenny     Economics  female
Yuba      Economics  female
Sara     Psychology  female
Wendy     Economics  female
Sera     Psychology  female

              major  gender
name
Abrabam     Physics    male
Brian    Psychology    male
Jenny     Economics  female
Yuba      Economics  female
Sara     Psychology  female
Wendy     Economics  female
Sera     Psychology  female

## Q 2-6
df_student2 에서 Brian, Sara의 데이타를 삭제하고 grade 컬럼을 추가하여라 

4.5, 4.0, 3.5, 4.0, 3.0

In [34]:
df_student2.drop(['Brian', 'Sara'], axis=0)

              major  gender
name
Abrabam     Physics    male
Jenny     Economics  female
Yuba      Economics  female
Wendy     Economics  female
Sera     Psychology  female

In [36]:
df_student2['grade'] = [4.5, 4.0, 3.5, 4.0, 3.0]
df_student2

ValueError: Length of values (5) does not match length of index (7)

In [37]:
df_student2.drop(['Brian', 'Sara'], axis=0, inplace=True)

In [38]:
df_student2['grade'] = [4.5, 4.0, 3.5, 4.0, 3.0]
df_student2

              major  gender  grade
name
Abrabam     Physics    male    4.5
Jenny     Economics  female    4.0
Yuba      Economics  female    3.5
Wendy     Economics  female    4.0
Sera     Psychology  female    3.0

              major  gender  grade
name
Abrabam     Physics    male    4.5
Jenny     Economics  female    4.0
Yuba      Economics  female    3.5
Wendy     Economics  female    4.0
Sera     Psychology  female    3.0

## Q 2-7
df_student2 데이타프레임에서 grade 컬럼명을 score로 변경하고 <br>
전체 컬럼 순서를 gender, score, major 순서로 변경하여라

In [40]:
df_student2 = df_student2.rename(columns={'grade': 'score'})
df_student2

              major  gender  score
name
Abrabam     Physics    male    4.5
Jenny     Economics  female    4.0
Yuba      Economics  female    3.5
Wendy     Economics  female    4.0
Sera     Psychology  female    3.0

In [41]:
df_student2 = df_student2[['gender', 'score', 'major']]
df_student2

         gender  score       major
name
Abrabam    male    4.5     Physics
Jenny    female    4.0   Economics
Yuba     female    3.5   Economics
Wendy    female    4.0   Economics
Sera     female    3.0  Psychology

## Q 2-8
df_student2.describe() 명령을 이용하여 아래와 같이 출력하여라

      grade
mean    3.8
25%     3.5
50%     4.0
75%     4.0

In [42]:
df_student2.describe()

          score
count  5.000000
mean   3.800000
std    0.570088
min    3.000000
25%    3.500000
50%    4.000000
75%    4.000000
max    4.500000

In [43]:
df_student2.describe().loc[['mean', '25%', '50%', '75%']]

      score
mean    3.8
25%     3.5
50%     4.0
75%     4.0

## Q3-1
```
아래의 CSV 파일을 df_weather 데이타프레임으로 생성하여라. 
이때 컬럼은 일시, 평균기온, 최고기온, 최저기온 으로만 한다 

기상온도_서울202012.csv

```

           일시  평균기온(℃)  최고기온(℃)  최저기온(℃)
0  1907-10-01     13.9     25.4      3.3
1  1907-11-01      5.3     21.3     -8.9
2  1907-12-01     -3.9      9.0    -20.1
3  1908-01-01     -3.5      6.2    -14.3
4  1908-02-01     -4.0      8.4    -15.8

In [45]:
df_weather = pd.read_csv('data/기상온도_서울202012.csv', encoding='cp949', usecols=[2, 3, 5, 8])
df_weather.head()

           일시  평균기온(℃)  최고기온(℃)  최저기온(℃)
0  1907-10-01     13.9     25.4      3.3
1  1907-11-01      5.3     21.3     -8.9
2  1907-12-01     -3.9      9.0    -20.1
3  1908-01-01     -3.5      6.2    -14.3
4  1908-02-01     -4.0      8.4    -15.8

## Q3-2
```
df_weather 데이타프레임에서 결측값이 각 컬럼별로 몇개가 있는지 출력하여라 
```

일시          8
평균기온(℃)    33
최고기온(℃)    33
최저기온(℃)    33
dtype: int64

In [46]:
df_weather.shape

(1353, 4)

## Q3-3
```
df_weather 데이타프레임에서 '일시' 컬럼값이 결측값 NaN으로 지정된 데이타를 출력하여라 
```

Int64Index([1345, 1346, 1347, 1348, 1349, 1350, 1351, 1352], dtype='int64')

In [47]:
df_weather[df_weather.isnull()['일시']]

       일시  평균기온(℃)  최고기온(℃)  최저기온(℃)
1345  NaN      NaN      NaN      NaN
1346  NaN      NaN      NaN      NaN
1347  NaN      NaN      NaN      NaN
1348  NaN      NaN      NaN      NaN
1349  NaN      NaN      NaN      NaN
1350  NaN      NaN      NaN      NaN
1351  NaN      NaN      NaN      NaN
1352  NaN      NaN      NaN      NaN

## Q3-4
```
df_weather 데이타프레임에서 행 모두의 값이 NaN이면 삭제하여라 
```

## Q3-5
```
df_weather 데이타프레임에서 결측값을 모두 0으로 변경하여라
```

일시         0
평균기온(℃)    0
최고기온(℃)    0
최저기온(℃)    0
dtype: int64

In [48]:
df_weather[df_weather.isnull()['평균기온(℃)']]

              일시  평균기온(℃)  최고기온(℃)  최저기온(℃)
515   1950-09-01      NaN      NaN      NaN
516   1950-10-01      NaN      NaN      NaN
517   1951-12-01      NaN      NaN      NaN
518   1952-01-01      NaN      NaN      NaN
519   1952-02-01      NaN      NaN      NaN
520   1952-03-01      NaN      NaN      NaN
521   1952-04-01      NaN      NaN      NaN
522   1952-05-01      NaN      NaN      NaN
523   1952-06-01      NaN      NaN      NaN
524   1952-07-01      NaN      NaN      NaN
525   1952-09-01      NaN      NaN      NaN
526   1952-10-01      NaN      NaN      NaN
527   1952-11-01      NaN      NaN      NaN
528   1952-12-01      NaN      NaN      NaN
529   1953-01-01      NaN      NaN      NaN
530   1953-02-01      NaN      NaN      NaN
531   1953-03-01      NaN      NaN      NaN
532   1953-04-01      NaN      NaN      NaN
533   1953-05-01      NaN      NaN      NaN
534   1953-06-01      NaN      NaN      NaN
535   1953-07-01      NaN      NaN      NaN
536   1953-08-01      NaN      NaN      NaN
537   1953-09-01      NaN      NaN      NaN
538   1953-10-01      NaN      NaN      NaN
539   1953-11-01      NaN      NaN      NaN
1345         NaN      NaN      NaN      NaN
1346         NaN      NaN      NaN      NaN
1347         NaN      NaN      NaN      NaN
1348         NaN      NaN      NaN      NaN
1349         NaN      NaN      NaN      NaN
1350         NaN      NaN      NaN      NaN
1351         NaN      NaN      NaN      NaN
1352         NaN      NaN      NaN      NaN

In [49]:
df_weather.fillna(value=0, inplace=True)

In [50]:
df_weather[df_weather.isnull()['평균기온(℃)']]

Empty DataFrame
Columns: [일시, 평균기온(℃), 최고기온(℃), 최저기온(℃)]
Index: []

In [51]:
df_weather.isnull().sum()

일시         0
평균기온(℃)    0
최고기온(℃)    0
최저기온(℃)    0
dtype: int64

## Q3-6
```
df_weather 데이타프레임에서 '일시' 컬럼의 데이타형을 시계열 형태로 변경하고 인덱스로 설정하여라. 
```

In [53]:
df_weather.dtypes

일시          object
평균기온(℃)    float64
최고기온(℃)    float64
최저기온(℃)    float64
dtype: object

In [57]:
df_weather['일시'] = pd.to_datetime(df_weather['일시'])

ValueError: time data "0" doesn't match format "%Y-%m-%d", at position 1345. You might want to try:
    - passing `format` if your strings have a consistent format;
    - passing `format='ISO8601'` if your strings are all ISO8601 but not necessarily in exactly the same format;
    - passing `format='mixed'`, and the format will be inferred for each element individually. You might want to use `dayfirst` alongside this.

In [58]:
df_weather.dtypes

일시          object
평균기온(℃)    float64
최고기온(℃)    float64
최저기온(℃)    float64
dtype: object

## Q3-7
```
df_weather 데이타프레임에서 2000 이후의 데이타만 출력하여라 
```

            평균기온(℃)  최고기온(℃)  최저기온(℃)
일시
2000-01-01     -2.1      9.9    -12.1
2000-02-01     -1.7      7.5    -11.6
2000-03-01      6.3     18.9     -4.8
2000-04-01     11.9     23.5      1.8
2000-05-01     17.5     30.5      7.9
...             ...      ...      ...
2020-08-01     26.5     34.5     21.5
2020-09-01     21.4     29.5     13.6
2020-10-01     14.3     23.6      3.2
2020-11-01      8.0     20.0     -3.6
2020-12-01     -0.2      9.4    -11.2

[252 rows x 3 columns]

In [59]:
df_weather['2000']

KeyError: '2000'

In [60]:
df_weather['2000':]

TypeError: cannot do slice indexing on RangeIndex with these indexers [2000] of type str